Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Why does GoogleTest support `EXPECT_EQ(NULL, ptr)` and `ASSERT_EQ(NULL, ptr)` but not `EXPECT_NE(NULL, ptr)` and `ASSERT_NE(NULL, ptr)`?
it_it: Perché GoogleTest supporta `EXPECT_EQ(NULL, ptr)` e `ASSERT_EQ(NULL, ptr)` ma non `EXPECT_NE(NULL, ptr)` e `ASSERT_NE(NULL, ptr)`?

source: Why does gMock do that?
it_it: Perché gMock lo fa?

source: Why does gMock work like that?
it_it: Perché gMock funziona così?

source: Why gMock?
it_it: Perché gMock?

source: Why should I prefer test fixtures over global variables?
it_it: Perché dovrei preferire le fixture alle variabili globali?

source: Why should test suite names and test names not contain underscore?
it_it: Perché i nomi delle test suite e dei test non devono contenere un underscore?

source: Why use the Google C++ Testing Framework?
it_it: Perché utilizzare Google C++ Testing Framework?

source: Why?
it_it: Perché?

source: Wildcard
it_it: Jolly [Wildcard]

source: Will be invoked on demand.
it_it: Verrà richiamato su richiesta.

source: Will be removed in v1.7.0.
it_it: Verrà rimosso nella v1.7.0.

source: Windows HRESULT Assertions {#HRESULT}
it_it: Asserzioni su HRESULT di Windows {#HRESULT}

source: Windows HRESULT assertions
it_it: Asserzioni HRESULT di Windows

source: With SetUp()/TearDown(), a subclass may make the mistake of forgetting to call the base class' SetUp()/TearDown() or call them at the wrong time.
it_it: Con SetUp()/TearDown(), una sottoclasse potrebbe commettere l'errore di dimenticare di chiamare la classe base di SetUp()/TearDown() o di chiamarla nel momento sbagliato.

source: With GoogleTest declared as a dependency, you can use GoogleTest code within your own project.
it_it: Con GoogleTest dichiarato come dipendenza, se ne può utilizzare il codice all'interno del progetto.

source: With GoogleTest, you can reuse shared resources across tests and pay for the set-up/tear-down only once, without making tests depend on each other.
it_it: Con GoogleTest si possono le risorse condivise tra i test e impegnarsi per l'installazione/de-installazione una sola volta, senza che i test dipendano gli uni dagli altri.

source: With `SetUp()/TearDown()`, a subclass may make the mistake of forgetting to call the base class' `SetUp()/TearDown()` or call them at the wrong time.
it_it: Con `SetUp()/TearDown()`, una sottoclasse potrebbe commettere l'errore di dimenticare di chiamare la classe base di `SetUp()/TearDown()` o di chiamarla nel momento sbagliato.

source: With a suitable message, it's often enough to use SCOPED_TRACE at the beginning of a sub-routine, instead of at each call site.
it_it: Con un messaggio adatto, spesso è sufficiente utilizzare SCOPED_TRACE all'inizio di una subroutine, anziché in ciascuna chiamata.

source: With a suitable message, it's often enough to use `SCOPED_TRACE` at the beginning of a sub-routine, instead of at each call site.
it_it: Con un messaggio adatto, spesso è sufficiente utilizzare `SCOPED_TRACE` all'inizio di una subroutine, anziché in ciascuna chiamata.

source: With gMock, you can create mocks in C++ easily.
it_it: Con gMock puoi creare facilmente mock in C++.

source: With that, you can use MockFoo in your tests as usual.
it_it: Con questo si può usare MockFoo nei test come al solito.

source: With that, you can use `MockFoo` in your tests as usual.
it_it: Con questo si può usare `MockFoo` nei test come al solito.

source: With that, you could write:
it_it: Con ciò, si potrebbe scrivere:

source: With the Linux pthread library, there is no turning back once you cross the line from a single thread to multiple threads.
it_it: Con la libreria pthread di Linux, non è possibile tornare indietro una volta oltrepassata la linea da un singolo thread a più thread.

source: With the above message, you should see that the actual F("a", "good") call is matched by the first EXPECT_CALL, not the third as you thought.
it_it: Col messaggio precedente, si vedrebbe che l'effettiva chiamata F("a", "good") corrisponde alla prima EXPECT_CALL, non alla terza come si pensava.

source: With the above message, you should see that the actual `F("a", "good")` call is matched by the first `EXPECT_CALL`, not the third as you thought.
it_it: Col messaggio precedente, si vedrebbe che l'effettiva chiamata `F("a", "good")` corrisponde alla prima `EXPECT_CALL`, non alla terza come si pensava.

source: With this definition, the above assertion will give a better message:
it_it: Con questa definizione, l’affermazione di cui sopra darà un messaggio migliore:

source: With this, gMock will verify that your code made the right calls (with the right arguments, in the right order, called the right number of times, etc), and a real object will answer the calls (so the behavior will be the same as in production).
it_it: Con questo, gMock verificherà che il codice abbia effettuato le chiamate giuste (con gli argomenti giusti, nell'ordine giusto, chiamato il numero giusto di volte, ecc.) e un oggetto reale risponderà alle chiamate (quindi il comportamento sarà lo stesso come in produzione).

source: With this, if GetDomainOwner("google.com") is called, it will do what the second EXPECT_CALL says; if it is called with a different argument, it will do what the first EXPECT_CALL says.
it_it: Con questo, se viene chiamato GetDomainOwner("google.com"), farà ciò che dice il secondo EXPECT_CALL; se viene chiamato con un argomento diverso, farà quello che dice il primo EXPECT_CALL.

source: With this, if `GetDomainOwner("google.com")` is called, it will do what the second `EXPECT_CALL` says; if it is called with a different argument, it will do what the first `EXPECT_CALL` says.
it_it: Con questo, se viene chiamato `GetDomainOwner("google.com")`, farà ciò che dice il secondo `EXPECT_CALL`; se viene chiamato con un argomento diverso, farà quello che dice il primo `EXPECT_CALL`.

source: With what arguments?
it_it: Con quali argomenti?

source: With your Bazel workspace set up, you can now use GoogleTest code within your own project.
it_it: Una volta configurato il workspace Bazel, si può utilizzare il codice GoogleTest all'interno del progetto.

source: Within a class body, declares an individual test as a friend of the class, enabling the test to access private class members.
it_it: All'interno del corpo di una classe, dichiara un singolo test come 'friend' della classe, consentendo al test di accedere ai membri privati della classe.

source: Within the test body, the test parameter can be accessed with the GetParam() function (see WithParamInterface).
it_it: Le istruzioni all'interno del corpo del test, è possibile accedere al parametro del test con la funzione GetParam() (vedere WithParamInterface).

source: Within the test body, the special name TypeParam refers to the type parameter, and TestFixture refers to the fixture class.
it_it: All'interno del corpo del test, il nome speciale TypeParam si riferisce al parametro del tipo e TestFixture si riferisce alla classe fixture.

source: Within the test body, the special name `TypeParam` refers to the type parameter, and `TestFixture` refers to the fixture class.
it_it: All'interno del corpo del test, il nome speciale `TypeParam` si riferisce al parametro del tipo e `TestFixture` si riferisce alla classe fixture.

source: Within the test body, the test parameter can be accessed with the `GetParam()` function (see [`WithParamInterface`](#WithParamInterface)).
it_it: Le istruzioni all'interno del corpo del test, è possibile accedere al parametro del test con la funzione `GetParam()` (vedere [`WithParamInterface`](#WithParamInterface)).

source: Without RetiresOnSaturation() on expectation 2, a third call to my_mock.SetNumber(7) would match expectation 2 again, producing a failure since the limit of 2 calls was exceeded.
it_it: Senza RetiresOnSaturation() sulla expectation 2, una terza chiamata a my_mock.SetNumber(7) corrisponderebbe [match] nuovamente alla expectation 2, producendo un errore poiché è stato superato il limite di 2 chiamate.

source: Without `RetiresOnSaturation()` on expectation 2, a third call to `my_mock.SetNumber(7)` would match expectation 2 again, producing a failure since the limit of 2 calls was exceeded.
it_it: Senza `RetiresOnSaturation()` sulla expectation 2, una terza chiamata a `my_mock.SetNumber(7)` corrisponderebbe [match] nuovamente alla expectation 2, producendo un errore poiché è stato superato il limite di 2 chiamate.

source: Without the restriction, the meaning of the following is unclear:
it_it: Senza la restrizione, il significato di quanto segue non è chiaro:

source: Without the trace, it would've been difficult to know which invocation of Sub1() the two failures come from respectively.
it_it: Senza il trace, sarebbe stato difficile sapere da quale invocazione di Sub1() provengono rispettivamente i due errori.

source: Without the trace, it would've been difficult to know which invocation of `Sub1()` the two failures come from respectively.
it_it: Senza il trace, sarebbe stato difficile sapere da quale invocazione di `Sub1()` provengono rispettivamente i due errori.

source: Won't it be nice if you have X-ray vision and can actually see the trace of all EXPECT_CALLs and mock method calls as they are made?
it_it: Non sarebbe bello se si avesse la vista a raggi X e si potessi effettivamente vedere la traccia di tutte le EXPECT_CALL e delle chiamate dei metodo mock mentre vengono effettuate?

source: Won't it be nice if you have X-ray vision and can actually see the trace of all `EXPECT_CALL`s and mock method calls as they are made?
it_it: Non sarebbe bello se si avesse la vista a raggi X e si potessi effettivamente vedere la traccia di tutte le `EXPECT_CALL` e delle chiamate dei metodo mock mentre vengono effettuate?

source: Worse, if your code interacts with a strict mock, your tests may start to fail and you'll be forced to fix them.
it_it: Peggio ancora, se il codice interagisce con un mock "strict", i test potrebbero iniziare a fallire e si sarà costretti a correggerli.

source: Worse, the macro definition of htonl() uses a gcc extension and is not standard C++.
it_it: Peggio ancora, la definizione della macro di htonl() utilizza un'estensione di gcc che non è C++ standard.

source: Worse, the macro definition of `htonl()` uses a `gcc` extension and is *not* standard C++.
it_it: Peggio ancora, la definizione della macro di `htonl()` utilizza un'estensione di `gcc` che *non* è C++ standard.

source: Would it be reasonable not to show the warning in this case?
it_it: Sarebbe ragionevole non mostrare il warning in questo caso?

source: Wouldn't ASSERT_EQ work?
it_it: ASSERT_EQ non funzionerebbe?

source: Writing New Action Templates Quickly
it_it: Scrivere Rapidamente una Nuove Template di Action

source: Writing New Actions {#QuickNewActions}
it_it: Scrivere Nuove Action {#QuickNewActions}

source: Writing New Cardinalities
it_it: Scrivere Nuove Cardinalità

source: Writing New Matchers Quickly {#NewMatchers}
it_it: Scrivere Rapidamente Nuovi Matcher {#NewMatchers}

source: Writing New Monomorphic Actions {#NewMonoActions}
it_it: Scrivere Nuove Azioni Monomorfiche {#NewMonoActions}

source: Writing New Monomorphic Matchers
it_it: Scrivere Nuovi Matcher Monomorfici

source: Writing New Parameterized Matchers Quickly
it_it: Scrivere Rapidamente Nuovi Matcher Parametrizzati

source: Writing New Polymorphic Actions {#NewPolyActions}
it_it: Scrivere Nuove Action Polimorfiche {#NewPolyActions}

source: Writing New Polymorphic Matchers
it_it: Scrivere Nuovi Matcher Polimorfici

source: Writing simply EXPECT_PRED1(IsPositive, 5); would result in a compiler error.
it_it: Scrivere semplicemente EXPECT_PRED1(IsPositive, 5); comporterebbe un errore del compilatore.

source: Writing simply `EXPECT_PRED1(IsPositive, 5);` would result in a compiler error.
it_it: Scrivere semplicemente `EXPECT_PRED1(IsPositive, 5);` comporterebbe un errore del compilatore.

source: Writing the Mock Class
it_it: Scrittura della Classe Mock

source: Writing the main() Function
it_it: Scrivere la Funzione main()

source: Yes, simply add the DISABLE_ prefix to the logical test name or the individual unit test name and it won't execute.
it_it: Sì, basta semplicemente aggiungere il prefisso DISABLE_ al nome del test logico o al nome della singola unit test e non verrà eseguito.

source: Yes.
it_it: Sì.

source: Yet
it_it: Tuttavia

source: Yet most programs are multi-threaded, and sometimes to test something we need to pound on it from more than one thread.
it_it: Eppure la maggior parte dei programmi sono multi-thread e talvolta per testare qualcosa abbiamo bisogno di lavorarci sopra da più di un thread.

source: Yet, a common pattern is that a test author wants to invoke a function without the arguments of the mock function.
it_it: Tuttavia, un pattern comune è che l'autore di un test desidera invocare una funzione senza gli argomenti della funzione mock.

source: Yields as std::tuple n-tuples all combinations (Cartesian product) of the values generated by the given n generators g1, g2, ..., gN.
it_it: Restituisce come std::tuple n tutte le combinazioni (prodotto cartesiano) dei valori generati dagli n generatori g1, g2, ..., gN.

source: Yields as `std::tuple` *n*-tuples all combinations (Cartesian product) of the values generated by the given *n* generators `g1`, `g2`, ..., `gN`.
it_it: Restituisce come `std::tuple` *n* tutte le combinazioni (prodotto cartesiano) dei valori generati dagli *n* generatori `g1`, `g2`, ..., `gN`.

source: Yields sequence {false, true}.
it_it: Restituisce la sequenza {false, true}.

source: Yields sequence `{false, true}`.
it_it: Restituisce la sequenza `{false, true}`.

source: Yields values {begin, begin+step, begin+step+step, ...}.
it_it: Restituisce i valori {begin, begin+step, begin+step+step, ...}.

source: Yields values {v1, v2, ..., vN}.
it_it: Restituisce i valori {v1, v2, ..., vN}.

source: Yields values `{begin, begin+step, begin+step+step, ...}`.
it_it: Restituisce i valori `{begin, begin+step, begin+step+step, ...}`.

source: Yields values `{v1, v2, ..., vN}`.
it_it: Restituisce i valori `{v1, v2, ..., vN}`.

source: Yields values from a C-style array, an STL-style container, or an iterator range [begin, end).
it_it: Restituisce valori da un array in stile C, un contenitore in stile STL o un iteratore range [begin, end).

source: Yields values from a C-style array, an STL-style container, or an iterator range `[begin, end)`.
it_it: Restituisce valori da un array in stile C, un contenitore in stile STL o un iteratore range `[begin, end)`.

source: Yields values generated by generator g, static_cast to T.
it_it: Restituisce i valori generati dal generatore g, static_cast a T.

source: Yields values generated by generator `g`, `static_cast` to `T`.
it_it: Restituisce i valori generati dal generatore `g`, `static_cast` to `T`.

source: You can always use Return, or a lambda or functor:
it_it: Si può sempre usare Return, o una lambda o un funtore:

source: You may see some really polished ones, but you may also see some that were hacked up in a hurry and have all sorts of ad hoc restrictions.
it_it: Se ne potrebbero vedere alcuni davvero raffinati, ma ce ne sono anche alcuni che sono stati fatti in fretta e hanno tutti i tipi di restrizioni ad hoc.

source: You need to make sure that *result contains some sensible value even when the function returns prematurely.
it_it: *result deve contenere un valore sensato anche quando la funzione ritorna prematuramente.

source: You only need to write the test logic once, although you must know the type list when writing typed tests.
it_it: È necessario scrivere la logica del test solo una volta, anche se è necessario conoscere l'elenco dei tipi quando si scrivono test tipizzati.

source: You should make a function virtual only when there is a valid reason for a subclass to override it.
it_it: Si deve rendere virtuale una funzione solo quando esiste un motivo valido per cui una sottoclasse la debba sovrascrivere [override].

source: You **must** call this function before calling `RUN_ALL_TESTS()`, or the flags won't be properly initialized.
it_it: Si **deve** chiamare questa funzione prima di chiamare `RUN_ALL_TESTS()`, altrimenti i flag non verranno inizializzati correttamente.

source: You must call this function before calling RUN_ALL_TESTS(), or the flags won't be properly initialized.
it_it: Si deve chiamare questa funzione prima di chiamare RUN_ALL_TESTS(), altrimenti i flag non verranno inizializzati correttamente.

source: You almost certainly want to abort or use SetUp/TearDown instead.
it_it: Quasi certamente si vuole, invece, abortire o usare SetUp/TearDown.

source: You almost certainly want to `abort` or use `SetUp`/`TearDown` instead.
it_it: Quasi certamente si vuole, invece, `abort`ire o usare `SetUp`/`TearDown`.

source: You are probably better off defining a small interface and call the function through that interface, which then can be easily mocked.
it_it: Probabilmente sarebbe meglio definire una piccola interfaccia e chiamare la funzione attraverso quell'interfaccia, che quindi può essere facilmente resa mock.

source: You are stuck with a sub-optimal design and wish you had done more prototyping before it was too late, but prototyping in C++ is by no means "rapid".
it_it: Si è bloccati con un progetto non ottimale e si vorrebbe aver fatto più prototipi prima che fosse troppo tardi, ma la prototipazione in C++ non è affatto "rapida".

source: You can alleviate this problem using extra logging or custom failure messages, but that usually clutters up your tests.
it_it: È possibile alleviare questo problema utilizzando log aggiuntivi o messaggi di errore personalizzati, ma ciò di solito è ingombrante per i test.

source: You can also easily define actions overloaded on the number of parameters:
it_it: Si possono anche definire facilmente overload di azioni sul numero di parametri:

source: You can also just use the string "json", in which case the output can be found in the test_detail.json file in the current directory.
it_it: Si può anche utilizzare semplicemente la stringa "json", nel qual caso l'output si trova nel file test_detail.json nella directory corrente.

source: You can also just use the string "xml", in which case the output can be found in the test_detail.xml file in the current directory.
it_it: Si può anche utilizzare semplicemente la stringa "xml", nel qual caso l'output si trova nel file test_detail.xml nella directory corrente.

source: You can also just use the string `"json"`, in which case the output can be found in the `test_detail.json` file in the current directory.
it_it: Si può anche utilizzare semplicemente la stringa `"json"`, nel qual caso l'output si trova nel file `test_detail.json` nella directory corrente.

source: You can also just use the string `"xml"`, in which case the output can be found in the `test_detail.xml` file in the current directory.
it_it: Si può anche utilizzare semplicemente la stringa `"xml"`, nel qual caso l'output si trova nel file `test_detail.xml` nella directory corrente.

source: You can also set up tests that report non-fatal failures after which the current test continues.
it_it: È inoltre possibile impostare test che riportino ad errori non fatali dopo i quali il test corrente continua.

source: You can also specify the repeat count by setting the GTEST_REPEAT environment variable.
it_it: Si può anche specificare il numero di ripetizioni impostando la variabile di ambiente GTEST_REPEAT.

source: You can also specify the repeat count by setting the `GTEST_REPEAT` environment variable.
it_it: Si può anche specificare il numero di ripetizioni impostando la variabile di ambiente `GTEST_REPEAT`.

source: You can also tell gMock that a mock object can be leaked and doesn't need to be verified:
it_it: Si può anche dire a gMock che un oggetto mock può essere perso [leaked] e non è necessario verificarlo:

source: You can also use -h, -?, or /? for short.
it_it: Si può usare anche -h, -? o /? per brevità.

source: You can also use `-h`, `-?`, or `/?` for short.
it_it: Si può usare anche `-h`, `-?`, o `/?` per brevità.

source: You can also use test events as checkpoints to implement a resource leak checker, for example.
it_it: È inoltre possibile utilizzare gli eventi dei test come checkpoint per implementare, ad esempio, un controllo delle perdite [leak] di risorse.

source: You can also write AllArgs(m) instead of m inside .With().
it_it: Si può anche scrivere AllArgs(m) invece di m in .With().

source: You can also write `AllArgs(m)` instead of `m` inside `.With()`.
it_it: Si può anche scrivere `AllArgs(m)` invece di `m` in `.With()`.

source: You can always override them with a string expression of your own:
it_it: Si possono sempre sovrascriverle con un'espressione string a scelta:

source: You can always override them with a `string` expression of your own:
it_it: Si possono sempre sovrascriverle con un'espressione `string` a scelta:

source: You can always use `Return`, or a [lambda or functor](#FunctionsAsActions):
it_it: Si può sempre usare `Return`, o una [lambda o un funtore](#FunctionsAsActions):

source: You can assign the result of expression Foo(p1, ..., pk) to a variable of type FooMatcherPk<p1_type, ..., pk_type>.
it_it: Si può assegnare il risultato dell'espressione Foo(p1, ..., pk) ad una variabile di tipo FooMatcherPk<p1_type, ..., pk_type>.

source: You can assign the result of expression `Foo(p1, ..., pk)` to a variable of type `FooMatcherPk<p1_type, ..., pk_type>`.
it_it: Si può assegnare il risultato dell'espressione `Foo(p1, ..., pk)` ad una variabile di tipo `FooMatcherPk<p1_type, ..., pk_type>`.

source: You can build complex matchers from existing ones using AllOf(), AllOfArray(), AnyOf(), AnyOfArray() and Not():
it_it: Si possono creare abbinamenti complessi da quelli esistenti utilizzando AllOf(), AllOfArray(), AnyOf(), AnyOfArray() e Not():

source: You can build complex matchers from existing ones using `AllOf()`, `AllOfArray()`, `AnyOf()`, `AnyOfArray()` and `Not()`:
it_it: Si possono creare abbinamenti complessi da quelli esistenti utilizzando `AllOf()`, `AllOfArray()`, `AnyOf()`, `AnyOfArray()` e `Not()`:

source: You can call Foo::Concrete() inside an action by:
it_it: Si può chiamare Foo::Concrete() all'interno di un'azione:

source: You can call `Foo::Concrete()` inside an action by:
it_it: Si può chiamare `Foo::Concrete()` all'interno di un'azione:

source: You can call a method declared as virtual, but it will not use dynamic dispatch.
it_it: Si può chiamare un metodo dichiarato come virtuale, ma non utilizzerà il dispatch dinamico.

source: You can call the function
it_it: Si può chiamare la funzione

source: You can change the order of the arguments, e.g. WithArgs<3, 2, 1>(...).
it_it: Si può cambiare l'ordine degli argomenti, p.es. WithArgs<3, 2, 1>(...).

source: You can change the order of the arguments, e.g. `WithArgs<3, 2, 1>(...)`.
it_it: Si può cambiare l'ordine degli argomenti, p.es. `WithArgs<3, 2, 1>(...)`.

source: You can check Boolean conditions, compare values based on relational operators, verify string values, floating-point values, and much more.
it_it: Si possono controllare le condizioni booleane, confrontare valori in base a operatori relazionali, verificare valori stringa, valori in virgola mobile e molto altro.

source: You can check in the interface and the adaptor somewhere near Concrete (perhaps in a contrib sub-directory) and let many projects use it.
it_it: Si può archiviare l'interfaccia e l'adattatore [adaptor] da qualche parte vicino a Concrete (probabilmente in una sotto-directory contrib) e lasciare che molti progetti la utilizzino.
